<a href="https://colab.research.google.com/github/tasyasvdh09/UAS_BIGDATA/blob/main/Implementasi_Spark_SQL_Kelompok_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Ujian Akhir Semester (UAS) - BIG DATA**

**Kelompok 6**
1. Annisa Mutiara
2. Sindy Alvina Khoiriyah
3. Tasya Sevia Adha

### **Implementasi Spark SQL**

In [3]:
# import folder yang ada di drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [29]:
# Install Apache Spark
!pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.4.0)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [30]:
# Import SparkSession
from pyspark.sql import SparkSession

In [31]:
# Inisialisasi SparkSession
spark = SparkSession.builder \
    .appName("Implementasi Spark SQL") \
    .getOrCreate()

In [32]:
# Membaca data dari file CSV
df = spark.read.csv("/content/drive/MyDrive/BIG DATA/UAS/data dummy bigdata.csv", header=True, inferSchema=True)

In [33]:
# Menampilkan schema dari DataFrame
df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- ethnicity: string (nullable = true)
 |-- birthdate: string (nullable = true)
 |-- address: string (nullable = true)
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)
 |-- phone_number: string (nullable = true)
 |-- email: string (nullable = true)
 |-- major: string (nullable = true)
 |-- gpa: double (nullable = true)
 |-- university: string (nullable = true)

In [46]:
# Menampilkan 30 baris pertama dari DataFrame
df.show(30)

+---+----------+----------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+
| id|first_name| last_name|age|     gender|           ethnicity| birthdate|             address|       city|       country|phone_number|               email|           major| gpa|          university|
+---+----------+----------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+
|  1|    Shandy|    Lorait| 27|     Female|          Melanesian| 9/12/1975|03 Green Ridge Point| Washington| United States|202-160-7386|      slorait0@51.la|     Engineering|1.76|Hamilton Technica...|
|  2|     Norma|Meneghelli| 51|     Female|                Cree| 8/22/1967|    58 Onsgard Court|    Milanów|        Poland|126-241-0283|nmeneghelli1@blog...|      Psychology|2.41|University of Warsaw|
|  3|  Chauncey|    Ivatts| 62|       Male|    Central American|  1/9/1999|   959 Fuller Center|   Pęczniew|        Poland|120-159-4158|civatts2@blogline...|         Biology| 2.1|Medical Academy ...|
|  4|   Barnabe|    Loades| 81|       Male|          Indonesian| 7/14/1976|268 Eastlawn Parkway|   Porecatu|        Brazil|102-532-1426|  bloades3@google.fr|     Engineering|2.94|Centro Universitá...|
|  5|   Kirsten|     Aggio| 45|     Female|     Native Hawaiian|11/11/1962|     66116 Union Way|Padangtikar|     Indonesia|307-834-1979|     kaggio4@nyu.edu|     Engineering|1.19|Universitas Bunda...|
|  6|       Yul|   MacGill| 75|   Bigender|         Argentinian|  2/9/1991|   83 Di Loreto Lane|      Jinli|         China|472-956-5329|      ymacgill5@g.co|      Psychology|2.12|Northeast Univers...|
|  7| Theresina|  Luebbert| 71|     Female|              Navajo| 7/30/1961|        14 Duke Lane| Fiorentino|    San Marino|103-519-9881|tluebbert6@topsy.com|     Engineering|3.97|University of San...|
|  8|   Hillier|   Cubbino| 93|       Male|                 Ute|12/12/1962| 982 Londonderry Way|   Sionogan|   Philippines|454-111-7536|    hcubbino7@va.gov|     Engineering| 2.0|Holy Angel Univer...|
|  9|   Micaela|    Collin| 71|     Female|               Sioux| 8/25/1967| 6611 Maywood Street|       Ta`ū|American Samoa|860-265-5430|mcollin8@domainma...|         Biology|3.02|Buddhist Acamedy ...|
| 10|  Herminia|   Nisbith| 93|     Female|            Filipino|  4/6/1979|   616 Hallows Alley|  Guadalupe|        Mexico|658-584-4540|hnisbith9@wordpre...|      Psychology|1.49|Universidad Valle...|
| 11|     Hewie|      Pogg| 88|       Male|    Central American| 3/28/1957|   87 Spohn Junction|     Mbigou|         Gabon|430-614-2986|hpogga@squarespac...|         Biology|2.89|Université Omar B...|
| 12|      Drew|    Basten| 45|       Male|                Crow| 7/13/1957| 0 Crest Line Street| El Quetzal|     Guatemala|263-198-2718|dbastenb@eventbri...|        Business|0.87| Universidad Galileo|
| 13|      Aime|  Reidshaw| 62|     Female|          Salvadoran|10/31/1969|   70 Beilfuss Court|  Ranchuelo|          Cuba|788-320-5668|areidshawc@mozill...|         Biology|3.66|Instituto Superio...|
| 14|       Wyn|  Vasyukov| 94|       Male|          Potawatomi|  7/4/1988|  88 Manitowish Lane|   Kasembon|     Indonesia|205-327-7530|    wvasyukovd@is.gd|Computer Science|2.95|Stie Perbanas Sur...|
| 15|  Reinwald|  Boissier| 48|       Male|          Ecuadorian| 5/18/1999|   387 Waxwing Place| La Francia|     Argentina|873-759-1875|  rboissiere@tiny.cc|     Engineering|1.78|Instituto Univers...|
| 16|   Lynette|     Dayce| 43|     Female|              Apache|  4/4/1976|       97 Dixon Lane|     Murcia|         Spain|707-562-1915|   ldaycef@tmall.com|         Biology| 0.8|Universitat Obert...|
| 17|      Otha|     Stoke| 41|     Female|Latin American In...| 11/6/1955|   07682 Moland Road|   Malikisi|         Kenya|840-949-9752|ostokeg@shinystat...|      Psychology|0.58|United States Int...|
| 18|    Floria|      Okie| 24|     Female|  Alaskan Athabascan| 8/19/1968|    3 Red Cloud Hill|Canavieiras|        Brazil|411-860-7059|fokieh@kickstarte...|     Engineering|0.37|Universidade São ...|
| 19|    Merwyn|  Weildish| 27|       Male|    Central American|12/24/1994|    849 Morrow Court|      Luoqi|         China|619-863-3914|mweildishi@virgin...|      Psychology|3.63|Fujian Normal Uni...|
| 20|     Suzie| St. Clair| 64|     Female|              Paiute| 9/23/1994|31527 Westerfield...|     Vittel|        France|492-304-0967| sstclairj@ocn.ne.jp|      Psychology|3.95|Ecole Nationale S...|
| 21|    Joella|    Cumber| 61|     Female|               White|  1/9/1990|    1147 Buhler Road| Bagumbayan|   Philippines|433-710-8376|jcumberk@redcross...|         Biology|1.71| Arellano University|
| 22| Gwendolin| Laugharne| 66|     Female|Latin American In...|  2/2/1973|   487 American Lane|   Taochuan|         China|364-765-1276|glaugharnel@googl...|         Biology|3.44|   Ludong University|
| 23|    Fergus|    Meneer| 87|       Male|      Tohono O'Odham| 9/23/1955|    5 Memorial Court|    Tiguion|   Philippines|100-248-9999|fmeneerm@twitpic.com|Computer Science|3.46|University of Per...|
| 24|    Ashlie| Molineaux| 70|     Female|          Sri Lankan|  7/1/1952|  8557 Anzinger Hill| Norrköping|        Sweden|477-856-8116|amolineauxn@mysql...|        Business|3.88|    Växjö University|
| 25|    Grayce|     Draco| 89|     Female|           Chickasaw| 8/16/1954|83159 Rutledge Te...|  Antsohihy|    Madagascar|549-962-6352|gdracoo@theguardi...|      Psychology|0.55|Université de Tol...|
| 26|      Saxe|    Heugle| 58|       Male|               Yaqui| 5/15/2005|   00 Anzinger Trail|    El Plan|      Honduras|792-184-2450|    sheuglep@mtv.com|        Business|0.68|Universidad José ...|
| 27|   Ceciley|    Hawker| 88|     Female|                Thai| 2/15/1950|       3 Dapin Trail|Yanglinqiao|         China|663-414-3130| chawkerq@census.gov|     Engineering|3.34|   Shanxi University|
| 28|    Stephi| Townshend| 94|     Female|          Indonesian| 4/12/1971|84085 Steensland ...| Tigarunggu|     Indonesia|750-705-2337|stownshendr@colum...|Computer Science|0.45|Institut Teknolog...|
| 29|     Cathi|    Bruins| 89|     Female|           Menominee| 9/15/1956|346 Lakewood Gard...| Sanxixiang|         China|221-963-3306|     cbruinss@wp.com|Computer Science|1.92|Xi'an University ...|
| 30|    Cherin|   Yoodall| 77|Genderfluid|          Vietnamese|11/30/1950|      7 Thierer Lane|      Lalig|   Philippines|321-612-0926|cyoodallt@ustream.tv|      Psychology|1.77|University of San...|
+---+----------+----------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+

In [35]:
# Menjalankan query menggunakan Spark SQL
df.createOrReplaceTempView("data")

In [114]:
# Menampilkan data yang diurutkan berdasarkan kolom first_name
query = "SELECT * FROM data ORDER BY first_name"
result = spark.sql(query)
result.show()

+---+----------+---------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+
| id|first_name|last_name|age|     gender|           ethnicity| birthdate|             address|       city|       country|phone_number|               email|           major| gpa|          university|
+---+----------+---------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+
| 13|      Aime| Reidshaw| 62|     Female|          Salvadoran|10/31/1969|   70 Beilfuss Court|  Ranchuelo|          Cuba|788-320-5668|areidshawc@mozill...|         Biology|3.66|Instituto Superio...|
| 24|    Ashlie|Molineaux| 70|     Female|          Sri Lankan|  7/1/1952|  8557 Anzinger Hill| Norrköping|        Sweden|477-856-8116|amolineauxn@mysql...|        Business|3.88|    Växjö University|
|  4|   Barnabe|   Loades| 81|       Male|          Indonesian| 7/14/1976|268 Eastlawn Parkway|   Porecatu|        Brazil|102-532-1426|  bloades3@google.fr|     Engineering|2.94|Centro Universitá...|
| 29|     Cathi|   Bruins| 89|     Female|           Menominee| 9/15/1956|346 Lakewood Gard...| Sanxixiang|         China|221-963-3306|     cbruinss@wp.com|Computer Science|1.92|Xi'an University ...|
| 27|   Ceciley|   Hawker| 88|     Female|                Thai| 2/15/1950|       3 Dapin Trail|Yanglinqiao|         China|663-414-3130| chawkerq@census.gov|     Engineering|3.34|   Shanxi University|
|  3|  Chauncey|   Ivatts| 62|       Male|    Central American|  1/9/1999|   959 Fuller Center|   Pęczniew|        Poland|120-159-4158|civatts2@blogline...|         Biology| 2.1|Medical Academy ...|
| 30|    Cherin|  Yoodall| 77|Genderfluid|          Vietnamese|11/30/1950|      7 Thierer Lane|      Lalig|   Philippines|321-612-0926|cyoodallt@ustream.tv|      Psychology|1.77|University of San...|
| 12|      Drew|   Basten| 45|       Male|                Crow| 7/13/1957| 0 Crest Line Street| El Quetzal|     Guatemala|263-198-2718|dbastenb@eventbri...|        Business|0.87| Universidad Galileo|
| 23|    Fergus|   Meneer| 87|       Male|      Tohono O'Odham| 9/23/1955|    5 Memorial Court|    Tiguion|   Philippines|100-248-9999|fmeneerm@twitpic.com|Computer Science|3.46|University of Per...|
| 18|    Floria|     Okie| 24|     Female|  Alaskan Athabascan| 8/19/1968|    3 Red Cloud Hill|Canavieiras|        Brazil|411-860-7059|fokieh@kickstarte...|     Engineering|0.37|Universidade São ...|
| 25|    Grayce|    Draco| 89|     Female|           Chickasaw| 8/16/1954|83159 Rutledge Te...|  Antsohihy|    Madagascar|549-962-6352|gdracoo@theguardi...|      Psychology|0.55|Université de Tol...|
| 22| Gwendolin|Laugharne| 66|     Female|Latin American In...|  2/2/1973|   487 American Lane|   Taochuan|         China|364-765-1276|glaugharnel@googl...|         Biology|3.44|   Ludong University|
| 10|  Herminia|  Nisbith| 93|     Female|            Filipino|  4/6/1979|   616 Hallows Alley|  Guadalupe|        Mexico|658-584-4540|hnisbith9@wordpre...|      Psychology|1.49|Universidad Valle...|
| 11|     Hewie|     Pogg| 88|       Male|    Central American| 3/28/1957|   87 Spohn Junction|     Mbigou|         Gabon|430-614-2986|hpogga@squarespac...|         Biology|2.89|Université Omar B...|
|  8|   Hillier|  Cubbino| 93|       Male|                 Ute|12/12/1962| 982 Londonderry Way|   Sionogan|   Philippines|454-111-7536|    hcubbino7@va.gov|     Engineering| 2.0|Holy Angel Univer...|
| 21|    Joella|   Cumber| 61|     Female|               White|  1/9/1990|    1147 Buhler Road| Bagumbayan|   Philippines|433-710-8376|jcumberk@redcross...|         Biology|1.71| Arellano University|
|  5|   Kirsten|    Aggio| 45|     Female|     Native Hawaiian|11/11/1962|     66116 Union Way|Padangtikar|     Indonesia|307-834-1979|     kaggio4@nyu.edu|     Engineering|1.19|Universitas Bunda...|
| 16|   Lynette|    Dayce| 43|     Female|              Apache|  4/4/1976|       97 Dixon Lane|     Murcia|         Spain|707-562-1915|   ldaycef@tmall.com|         Biology| 0.8|Universitat Obert...|
| 19|    Merwyn| Weildish| 27|       Male|    Central American|12/24/1994|    849 Morrow Court|      Luoqi|         China|619-863-3914|mweildishi@virgin...|      Psychology|3.63|Fujian Normal Uni...|
|  9|   Micaela|   Collin| 71|     Female|               Sioux| 8/25/1967| 6611 Maywood Street|       Ta`ū|American Samoa|860-265-5430|mcollin8@domainma...|         Biology|3.02|Buddhist Acamedy ...|
+---+----------+---------+---+-----------+--------------------+----------+--------------------+-----------+--------------+------------+--------------------+----------------+----+--------------------+
only showing top 20 rows

In [115]:
# Menampilkan kolom "first_name", "address", "city", "country", "phone_number" dan "email"
query = "SELECT id, first_name, address, city, country, phone_number, email FROM data"
result = spark.sql(query)
result.show(15)

+---+----------+--------------------+-----------+--------------+------------+--------------------+
| id|first_name|             address|       city|       country|phone_number|               email|
+---+----------+--------------------+-----------+--------------+------------+--------------------+
|  1|    Shandy|03 Green Ridge Point| Washington| United States|202-160-7386|      slorait0@51.la|
|  2|     Norma|    58 Onsgard Court|    Milanów|        Poland|126-241-0283|nmeneghelli1@blog...|
|  3|  Chauncey|   959 Fuller Center|   Pęczniew|        Poland|120-159-4158|civatts2@blogline...|
|  4|   Barnabe|268 Eastlawn Parkway|   Porecatu|        Brazil|102-532-1426|  bloades3@google.fr|
|  5|   Kirsten|     66116 Union Way|Padangtikar|     Indonesia|307-834-1979|     kaggio4@nyu.edu|
|  6|       Yul|   83 Di Loreto Lane|      Jinli|         China|472-956-5329|      ymacgill5@g.co|
|  7| Theresina|        14 Duke Lane| Fiorentino|    San Marino|103-519-9881|tluebbert6@topsy.com|
|  8|   Hillier| 982 Londonderry Way|   Sionogan|   Philippines|454-111-7536|    hcubbino7@va.gov|
|  9|   Micaela| 6611 Maywood Street|       Ta`ū|American Samoa|860-265-5430|mcollin8@domainma...|
| 10|  Herminia|   616 Hallows Alley|  Guadalupe|        Mexico|658-584-4540|hnisbith9@wordpre...|
| 11|     Hewie|   87 Spohn Junction|     Mbigou|         Gabon|430-614-2986|hpogga@squarespac...|
| 12|      Drew| 0 Crest Line Street| El Quetzal|     Guatemala|263-198-2718|dbastenb@eventbri...|
| 13|      Aime|   70 Beilfuss Court|  Ranchuelo|          Cuba|788-320-5668|areidshawc@mozill...|
| 14|       Wyn|  88 Manitowish Lane|   Kasembon|     Indonesia|205-327-7530|    wvasyukovd@is.gd|
| 15|  Reinwald|   387 Waxwing Place| La Francia|     Argentina|873-759-1875|  rboissiere@tiny.cc|
+---+----------+--------------------+-----------+--------------+------------+--------------------+
only showing top 15 rows

In [116]:
# Menampilkan data id, first_name, birthdate yang huruf awal dari first_name adalah 'C'
query = "SELECT id, first_name, birthdate FROM data WHERE LEFT(first_name, 1) = 'C'"
result = spark.sql(query)
result.show()

+---+----------+----------+
| id|first_name| birthdate|
+---+----------+----------+
|  3|  Chauncey|  1/9/1999|
| 27|   Ceciley| 2/15/1950|
| 29|     Cathi| 9/15/1956|
| 30|    Cherin|11/30/1950|
+---+----------+----------+

In [117]:
# Menampilkan data yang diurutkan berdasarkan kolom "age" secara menurun
query = "SELECT * FROM data ORDER BY age DESC"
result = spark.sql(query)
result.show(10)

+---+----------+---------+---+------+----------------+----------+--------------------+-----------+-----------+------------+--------------------+----------------+----+--------------------+
| id|first_name|last_name|age|gender|       ethnicity| birthdate|             address|       city|    country|phone_number|               email|           major| gpa|          university|
+---+----------+---------+---+------+----------------+----------+--------------------+-----------+-----------+------------+--------------------+----------------+----+--------------------+
| 14|       Wyn| Vasyukov| 94|  Male|      Potawatomi|  7/4/1988|  88 Manitowish Lane|   Kasembon|  Indonesia|205-327-7530|    wvasyukovd@is.gd|Computer Science|2.95|Stie Perbanas Sur...|
| 28|    Stephi|Townshend| 94|Female|      Indonesian| 4/12/1971|84085 Steensland ...| Tigarunggu|  Indonesia|750-705-2337|stownshendr@colum...|Computer Science|0.45|Institut Teknolog...|
|  8|   Hillier|  Cubbino| 93|  Male|             Ute|12/12/1962| 982 Londonderry Way|   Sionogan|Philippines|454-111-7536|    hcubbino7@va.gov|     Engineering| 2.0|Holy Angel Univer...|
| 10|  Herminia|  Nisbith| 93|Female|        Filipino|  4/6/1979|   616 Hallows Alley|  Guadalupe|     Mexico|658-584-4540|hnisbith9@wordpre...|      Psychology|1.49|Universidad Valle...|
| 25|    Grayce|    Draco| 89|Female|       Chickasaw| 8/16/1954|83159 Rutledge Te...|  Antsohihy| Madagascar|549-962-6352|gdracoo@theguardi...|      Psychology|0.55|Université de Tol...|
| 29|     Cathi|   Bruins| 89|Female|       Menominee| 9/15/1956|346 Lakewood Gard...| Sanxixiang|      China|221-963-3306|     cbruinss@wp.com|Computer Science|1.92|Xi'an University ...|
| 11|     Hewie|     Pogg| 88|  Male|Central American| 3/28/1957|   87 Spohn Junction|     Mbigou|      Gabon|430-614-2986|hpogga@squarespac...|         Biology|2.89|Université Omar B...|
| 27|   Ceciley|   Hawker| 88|Female|            Thai| 2/15/1950|       3 Dapin Trail|Yanglinqiao|      China|663-414-3130| chawkerq@census.gov|     Engineering|3.34|   Shanxi University|
| 23|    Fergus|   Meneer| 87|  Male|  Tohono O'Odham| 9/23/1955|    5 Memorial Court|    Tiguion|Philippines|100-248-9999|fmeneerm@twitpic.com|Computer Science|3.46|University of Per...|
|  4|   Barnabe|   Loades| 81|  Male|      Indonesian| 7/14/1976|268 Eastlawn Parkway|   Porecatu|     Brazil|102-532-1426|  bloades3@google.fr|     Engineering|2.94|Centro Universitá...|
+---+----------+---------+---+------+----------------+----------+--------------------+-----------+-----------+------------+--------------------+----------------+----+--------------------+
only showing top 10 rows

In [122]:
# Menampilkan usia yang lebih dari 90 tahun
query = "SELECT * FROM data WHERE age > 90"
result = spark.sql(query)
result.show()

+---+----------+---------+---+------+----------+----------+--------------------+----------+-----------+------------+--------------------+----------------+----+--------------------+
| id|first_name|last_name|age|gender| ethnicity| birthdate|             address|      city|    country|phone_number|               email|           major| gpa|          university|
+---+----------+---------+---+------+----------+----------+--------------------+----------+-----------+------------+--------------------+----------------+----+--------------------+
|  8|   Hillier|  Cubbino| 93|  Male|       Ute|12/12/1962| 982 Londonderry Way|  Sionogan|Philippines|454-111-7536|    hcubbino7@va.gov|     Engineering| 2.0|Holy Angel Univer...|
| 10|  Herminia|  Nisbith| 93|Female|  Filipino|  4/6/1979|   616 Hallows Alley| Guadalupe|     Mexico|658-584-4540|hnisbith9@wordpre...|      Psychology|1.49|Universidad Valle...|
| 14|       Wyn| Vasyukov| 94|  Male|Potawatomi|  7/4/1988|  88 Manitowish Lane|  Kasembon|  Indonesia|205-327-7530|    wvasyukovd@is.gd|Computer Science|2.95|Stie Perbanas Sur...|
| 28|    Stephi|Townshend| 94|Female|Indonesian| 4/12/1971|84085 Steensland ...|Tigarunggu|  Indonesia|750-705-2337|stownshendr@colum...|Computer Science|0.45|Institut Teknolog...|
+---+----------+---------+---+------+----------+----------+--------------------+----------+-----------+------------+--------------------+----------------+----+--------------------+

In [121]:
# Menampilkan data dengan usia antara 60 sampai 70 tahun
query = "SELECT * FROM data WHERE age BETWEEN 60 AND 70"
result = spark.sql(query)
result.show()

+---+----------+---------+---+------+--------------------+----------+--------------------+----------+-----------+------------+--------------------+----------+----+--------------------+
| id|first_name|last_name|age|gender|           ethnicity| birthdate|             address|      city|    country|phone_number|               email|     major| gpa|          university|
+---+----------+---------+---+------+--------------------+----------+--------------------+----------+-----------+------------+--------------------+----------+----+--------------------+
|  3|  Chauncey|   Ivatts| 62|  Male|    Central American|  1/9/1999|   959 Fuller Center|  Pęczniew|     Poland|120-159-4158|civatts2@blogline...|   Biology| 2.1|Medical Academy ...|
| 13|      Aime| Reidshaw| 62|Female|          Salvadoran|10/31/1969|   70 Beilfuss Court| Ranchuelo|       Cuba|788-320-5668|areidshawc@mozill...|   Biology|3.66|Instituto Superio...|
| 20|     Suzie|St. Clair| 64|Female|              Paiute| 9/23/1994|31527 Westerfield...|    Vittel|     France|492-304-0967| sstclairj@ocn.ne.jp|Psychology|3.95|Ecole Nationale S...|
| 21|    Joella|   Cumber| 61|Female|               White|  1/9/1990|    1147 Buhler Road|Bagumbayan|Philippines|433-710-8376|jcumberk@redcross...|   Biology|1.71| Arellano University|
| 22| Gwendolin|Laugharne| 66|Female|Latin American In...|  2/2/1973|   487 American Lane|  Taochuan|      China|364-765-1276|glaugharnel@googl...|   Biology|3.44|   Ludong University|
| 24|    Ashlie|Molineaux| 70|Female|          Sri Lankan|  7/1/1952|  8557 Anzinger Hill|Norrköping|     Sweden|477-856-8116|amolineauxn@mysql...|  Business|3.88|    Växjö University|
+---+----------+---------+---+------+--------------------+----------+--------------------+----------+-----------+------------+--------------------+----------+----+--------------------+

In [123]:
# Menampilkan rata-rata usia
query = "SELECT AVG(age) AS average_age FROM data"
result = spark.sql(query)
result.show()

+-----------------+
|      average_age|
+-----------------+
|66.13333333333334|
+-----------------+

In [124]:
# Menampilkan jumlah data per jurusan
query = "SELECT major, COUNT(*) AS count FROM data GROUP BY major"
result = spark.sql(query)
result.show()

+----------------+-----+
|           major|count|
+----------------+-----+
|     Engineering|    8|
|      Psychology|    8|
|        Business|    3|
|Computer Science|    4|
|         Biology|    7|
+----------------+-----+

In [125]:
# Menampilkan jumlah data gender per kategori "Female"
query = "SELECT gender, COUNT(*) AS count FROM data WHERE gender = 'Female' GROUP BY gender"
result = spark.sql(query)
result.show()

+------+-----+
|gender|count|
+------+-----+
|Female|   18|
+------+-----+

In [126]:
# Menampilkan data nama, jurusan, ipk, dan universitas dengan nilai tertinggi per jurusan
query = "SELECT first_name, last_name, major, gpa, university FROM (SELECT first_name, last_name, major, gpa, university, ROW_NUMBER() OVER (PARTITION BY major ORDER BY gpa DESC) AS rank FROM data) ranked WHERE rank = 1"
result = spark.sql(query)
result.show()

+----------+---------+----------------+----+--------------------+
|first_name|last_name|           major| gpa|          university|
+----------+---------+----------------+----+--------------------+
|      Aime| Reidshaw|         Biology|3.66|Instituto Superio...|
|    Ashlie|Molineaux|        Business|3.88|    Växjö University|
|    Fergus|   Meneer|Computer Science|3.46|University of Per...|
| Theresina| Luebbert|     Engineering|3.97|University of San...|
|     Suzie|St. Clair|      Psychology|3.95|Ecole Nationale S...|
+----------+---------+----------------+----+--------------------+

In [127]:
# Menutup SparkSession
spark.stop()